void setup(){
  size(800,900);
}

void draw(){
  //背景绿色
  background(248,177,149);
  noStroke();
  //背景渐变效果
  fill(246,114,128);
  rect(0,200,800,80);
  fill(192,108,132);
  rect(0,280,800,80);
  fill(108,91,123);
  rect(0,360,800,80);
  fill(53,92,125);
  rect(0,440,800,550);
  //图形1 背景三角形
  fill(116,115,122);
  triangle(400,50,50,750,750,750);
  
  strokeWeight(3);
  //图形29 身体 蓝色
  fill(0,165,227);
  triangle(300,600,360,590,280,700);
  //图形30 身体 草绿
  fill(141,215,191);
  triangle(500,600,440,590,520,700);
  //图形31 身体 粉色
  fill(255,150,197);
  quad(280,700,360,590,400,610,340,780);
  //图形32 身体 橙色
  fill(255,191,101);
  quad(520,700,440,590,400,610,460,780);
  //图形33 身体 蓝灰
  fill(108,136,196);
  triangle(400,610,340,780,400,770);
  //图形34 身体 酒红
  fill(192,87,128);
  triangle(400,610,460,780,400,770);
  

  //图形3 耳朵 亮绿
  fill(207,248,0);
  triangle(350,360,350,400,370,400);
  //图形4 耳朵 橙色
  fill(255,191,101);
  triangle(450,360,450,400,430,400);
  

  //图形7 头部 黄色
  fill(255,236,89);
  triangle(330,430,400,430,400,550);
  //图形8 头部 红色
  fill(231,117,119);
  triangle(470,430,400,430,400,550);
  
  //图形2 头部 亮粉色
  fill(255,96,168);
  rect(350,400,100,50);
  //图形5 头部 肉粉色
  fill(255,218,204);
  triangle(350,400,330,430,350,450);
  //图形6 头部 绿色
  fill(0,176,186);
  triangle(450,400,470,430,450,450);
  
  //图形9 头部 橙色
  fill(255,191,101);
  triangle(330,430,330,490,400,550);
  //图形10 头部 酒红
  fill(192,87,128);
  triangle(470,430,470,490,400,550);
   
  //图形11 头部 绿色
  fill(77,208,145);
  triangle(330,490,300,500,400,550);
  //图形12 头部 草绿
  fill(141,215,191);
  triangle(470,490,500,500,400,550);
  
  //图形13 头部 红色 
  fill(231,117,119);
  triangle(280,550,300,500,400,550);
  //图形14 头部 蓝灰
  fill(108,136,196);
  triangle(520,550,500,500,400,550);
  
  //图形15 头部 橙红
  fill(252,98,56);
  triangle(280,550,280,600,400,550);
  //图形16 头部 蓝色
  fill(0,165,227);
  triangle(520,550,520,600,400,550);
  
  //图形17 头部 肉粉色
  fill(255,218,204);
  triangle(300,630,280,600,400,550);
  //图形18 头部 亮粉色
  fill(255,96,168);
  triangle(500,630,520,600,400,550);
  
  //图形19 头部 黄色
  fill(255,236,89);
  triangle(300,630,400,610,400,550);
  //图形20 头部 绿色
  fill(77,208,145);
  triangle(500,630,400,610,400,550);
  
  //图形21 嘴部 亮绿
  fill(207,248,0);
  triangle(400,600,360,620,400,640);
  //图形22 嘴部 蓝绿
  fill(0, 176, 186);
  triangle(400,600,440,620,400,640);
  
  //图形23 嘴部 土色
  fill(231,197,130);
  triangle(400,600,380,610,400,620);
  //图形24 嘴部 肉色
  fill(242,212,204);
  triangle(400,600,420,610,400,620);

  //图形25 耳朵 蓝灰色
  fill(108,136,196);
  triangle(350,400,260,190,330,430);
  //图形26 耳朵 蓝色
  fill(0,165,227);
  triangle(450,400,540,190,470,430);
  //图形27 耳朵 草绿
  fill(141,215,191);
  triangle(250,340,260,190,330,430);
  //图形28 耳朵 酒红
  fill(192,87,128);
  triangle(550,340,540,190,470,430);
  

  //图形35 鼻子 灰色
  fill(116,115,122);
  ellipse(400,550,50,40);
  

}

void mousePressed(){
  println(mouseX,mouseY);
}
